Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType
ConceptualConstructionType values for Windows and Skylights
Since:
2012
Since:
2012

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.NumWindowSkylightTypeConstruction
Total Number of Window or Skylight Type Constructions

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.QuadPaneClearLowEHotOrColdClimate
Quad Pane Clear Low Energy Hot Or Cold Climate Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.TriplePaneClearLowEHotOrColdClimate
Triple Pane Clear Low Energy Hot or Cold Climate Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneClearHighestPerformanceLowEHighVisTransLowSHGC
Double Pane Clear Highest Performance Low Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneClearLowEHotClimateLowSHGC
Double Pane Clear Low Energy Hot Climate Low Solar Heat Gain Coefficient Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneClearLowEColdClimateHighSHGC
Double Pane Clear Low Energy Cold Climate High Solar Heat Gain Coefficient Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneReflective
Double Pane Reflective Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneTinted
Double Pane Tinted Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.DoublePaneClearNoCoating
Double Pane Clear No Coating Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.SinglePaneReflective
Single Pane Reflective Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.SinglePaneTinted
Single Pane Tinted Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.SinglePaneClearNoCoating
Single Pane Clear No Coating Window or Skylight

Autodesk.Revit.DB.Analysis.ConceptualConstructionWindowSkylightType.InvalidWindowSkylightTypeConstruction
Invalid value/not set Window or Skylight Type Construction